Revit 2027 API
BuiltInFailures.ConnectorFailures.InvalidConnectionRef Property
 The selected fitting has invalid connections and must be deleted to continue.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidConnectionRef { get; }
Public Shared ReadOnly Property InvalidConnectionRef As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidConnectionRef {
	FailureDefinitionId^ get ();
}
static member InvalidConnectionRef : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace